INSERT INTO  categories (`name`)
values ('MOUNTAIN'),
       ('CITY'),
       ('SEASIDE'),
       ('ECO_FRIENDLY');

INSERT INTO  roles (`role`)
values ('USER'),
       ('ADMIN');

INSERT INTO pictures (url)
VALUES ('https://res.cloudinary.com/dabxnbbrp/image/upload/v1637539537/zidyt1xbpr7cjquafp4l.png'),
       ('https://res.cloudinary.com/dabxnbbrp/image/upload/v1637528308/sodjh4ukaucugkzdbho3.png'),
       ('https://res.cloudinary.com/dabxnbbrp/image/upload/v1638634970/myy2j7ppbkgdlwlwoqpc.png'),
       ('https://res.cloudinary.com/dabxnbbrp/image/upload/v1638635308/okwnhylolyeao7hftcrq.jpg'),
       ('https://res.cloudinary.com/dabxnbbrp/image/upload/v1637959456/vpl2i8zwtpozmgrkdvoz.jpg'),
        ('https://res.cloudinary.com/dabxnbbrp/image/upload/v1637148359/3_uwvoom.jpg'),
       ('https://res.cloudinary.com/dabxnbbrp/image/upload/v1637148360/2_cy8g2h.jpg'),
       ('https://res.cloudinary.com/dabxnbbrp/image/upload/v1637148380/4_wlvzrb.jpg'),
       ('https://res.cloudinary.com/dabxnbbrp/image/upload/v1637148377/1_sw7qex.jpg'),
       ('https://res.cloudinary.com/dabxnbbrp/image/upload/v1637093619/nqnxpyq2lasrpus8mm6q.jpg'),
       ('https://res.cloudinary.com/dabxnbbrp/image/upload/v1637077858/dpwdevalzbvqrtnxnnjk.jpg');

INSERT INTO  users (email, first_name, last_name, password, status, username, profile_picture_url_id)
values ('admin@gmail.com', 'Admin', 'Adminov', 'a20913c3bd79c3f36f828e2533058a4bd5c2229f5cfe51183e82606ab461cedf13e7c7e7ca51caab', true, 'admin', 1),
       ('pesho@gmail.com', 'Petyr', 'Petrov', 'f5d3ef035ee251222e29d25a2019128ccdb3bec7f71a4b6e1236311cdc321e19c73294436e0464c2', true, 'pesho', 2);

INSERT INTO  users_roles (user_entity_id, roles_id)
values (1, 1),
       (1, 2),
       (2, 1);

INSERT INTO  towns (`name`)
values ('Своге'),
       ('Зверино'),
       ('Белоградчик'),
       ('Рибиша'),
       ('Пловдив'),
       ('Татул'),
       ('Момчилград'),
       ('Ардино'),
       ('Лясковец'),
       ('Перник'),
       ('Лозенец'),
       ('Калофер'),
       ('Стара Планина'),
       ('Карлово');

INSERT INTO  breakfast_places (`name`)
values ('Пицария "Ини"'),
       ('Комплекс "Магурата"'),
       ('"Мекица и Кафе"'),
       ('Гастро бар "Айлякрия'),
       ('Ресторант Аквафантазия'),
       ('Бунгала "Френдс'),
       ('Плаващ ресторант "Моби дик'),
       ('Снек бар "Макс"'),
       ('Комплекс Оазис'),
       ('Ресторант-градина Казабланка'),
       ('Хотел „Бела Нела'),
       ('Хотел „Паниците'),
       ('Хотел „Панорама“'),
       ('Хижа „Рай“'),
       ('хотел „Ханът“');

INSERT INTO  coffee_places (`name`)
values ('Снек бар "Макс"'),
       ('Комплекс Оазис'),
       ('Панорамен ресторант „Мислен камък“'),
       ('Комплекс „Магура“'),
        ('Уест кафе'),
       ('Блустоун Донътс'),
       ('Котка и мишка'),
       ('Ресторант Аквафантази'),
       ('Бунгала „Френдс“'),
       ('Бар „Гоги“'),
       ('Плаващ ресторант „Моби дик“'),
       ('Ресторант-градина Казабланка'),
       ('Хотел „Бела Нела'),
       ('Хотел „Паниците'),
       ('Хотел „Панорама“'),
       ('Хижа „Рай“'),
       ('хотел „Ханът“'),
       ('кафе Фиеста');

INSERT INTO  dinner_places (`name`)
values ('Ресторант Искър'),
       ('Комплекс Оазис'),
       ('Комплекс „Магура“'),
       ('Ресторант „Паваж“'),
       ('Ресторант АРТиШОК'),
       ('Ресторант-градина Филопополис'),
       ('Кораб – ресторант „Емона'),
       ('Ресторант „Елит“'),
       ('Ресторант „Хемингуей“'),
       ('Ресторант „Премиум кебап“'),
       ('Бела Нела'),
       ('Хотел „Паниците'),
       ('Гостоприемница Георги'),
       ('Хижа „Рай“'),
       ('Механа Калоферска Къща'),
       ('Механа „Водопада“'),
       ('Ресторант Карлово'),
       ('Механа „Водопада“');

INSERT INTO hotels (`name`)
values ('Хотел „Маймун дере“'),
       ('Комплекс Оазис'),
       ('Комплекс „Магура“'),
       ('Хотел „Премиер“'),
       ('Бунгала „Френдс“'),
       ('Бела Нела'),
       ('Хотел „Паниците'),
       ('Хотел „Панорама“'),
       ('Хижа „Рай“'),
       ('Хотел "Ханът"');

INSERT INTO  details (equipment, festivals, foto_tips)
values ('Топли дрехи при решение да посетите през есенно-зимен сезон.', '7 ноември – събор на с. Зверино, на който всяко семейство опъва богата трапеза и кани гости.', 'Снимка на изкуствено създаденото езеро в комплекса непосредствено до алпийски тип къщи'),
       ('Климатът е преходно-континентален със средната годишна температура е 12,3 °С', 'Ежегодно в последната събота на септември на откритите пространства и в къщите на Старинен Пловдив се изнасят концерти на фолклорни танцови и вокални групи, джаз-балетни формации, хорове, рок и джаз групи, състави за стари градски песни, камерни театрални спектакли и др. Капана фест.', 'Панорамна снимка на града от Пловдивските тепета, Небет тепе. Снимка със статуята на на Мильо. Снимка на пеещите фонтани. Снимка при шарения надпис Together, слоганът на Европейската столица на културата 2019 г. Снимка при графитите на квартал Капана, както и на улица „Златарска“.'),
       ('Климатът в района е континентално-средиземноморски, мек и влажен, с много слънчеви дни в годината. Най-продължителното слънчево греене в Кърджали се наблюдава през юни, юли и август.', 'Празникът на град Кърджали е на 21 октомври. На тази дата през 1912 г. Кърджали е присъединен към територията на България (дотогава е бил в пределите на Османската империя). Смята се, че градът е присъединен точно в 12 часа по обяд и по тази причина градският часовник свири „Велик е нашият войник“ преди да удари 12 пъти (на всеки кръгъл час свири български възрожденски песни)', 'Снимка в определен част: казват, че от Дяволския мост при Ардино може да видиш лика на Сатаната, ако погледнеш към водите на река Арда между 11.00 и 12.00 часа на обед, когато мостът и отражението му образуват окръжност. Панорамна снимка на меандрите на река Арда.'),
       ('Обувки със стабилна подметка за пещера Магура.', 'Ежегоден летен фестивал „Опера на върховете – Белоградчик и скали“. Балонена фиеста.', 'Снимка от балон.'),
        ('Подходящо облекло имайки предвид, че в Зоокът „Лесковец" се допуска контакт с животните и свободна разходка в естествения им хабитат. ', 'Октомври месец – празник на град Перник ', ' Снимка с камилата Милчо в Зоокът „Лесковец".'),
       ('Планински обувки и щеки за дълъг преход до хижа „Рай“. ','През последния уикенд на месец юли в местността „Паниците“ се провежда конкурс на гайдари на Националния фолклорен фестивал на гайдата.', 'Снимка от връх Ботев.');

INSERT INTO  attractions (`name`)
values ('Искрецки манастир „Успение Богородично"'),
       ('Манастир „Седемте престола“'),
       ('Белоградчишка крепост'),
       ('Художествената галерия'),
       ('Пещера Магура'),
       ('Джумая джамия; Пеещите фонтани'),
       ('Квартал Капана'),
       ('Архитектурно-исторически резерват „Старинен Пловдив“'),
       ('Язовир Кърджали'),
       ('Тракийско светилище „Татул“'),
       ('Скален феномен „Каменната сватба“'),
       ('Тракийското светилището „Орлови скали“; Дяволският мост'),
       ('Риболов'),
       ('Музей на авиацията'),
       ('Зоокът „Лесковец'),
       ('Умалено копие на Айфеловата кула - Перни'),
       ('водопад „Райското пръскало'),
       ('връх Ботев'),
       ('Къща и музей на Христо Ботев'),
       ('Екопътека Бяла река'),
       ('Язовир Домлян'),
       ('Храм Св. Богородица - Карлово'),
       ('Водопад Сучурум');

INSERT INTO trips (description, duration, rating, start_point, category_entity_id, details_id, picture_id, user_id)
VALUES ('Градът е разположен в живописното Искърското дефиле при устието на Искрецка река. На това място се събират границите на три планини: Мала планина, Голема планина и Понор.', 2, 2, 'Татул', 1, 1, 8, 1),
        ('Благоустроен и приветлив, Белоградчик е сред атрактивните туристически обекти на България. Предлага възможности за излетен, пещерен и конгресен туризъм, алпинизъм, лов и риболов, спорт и астрономически наблюдения. Девизът на града е „Вечен и Млад“.', 3, 1, 'Белоградчик', 1, 4, 7, 2),
       ('Пловдив е град на над 8000 години, чието минало може да се проследи от праисторията до наши дни. Девизът на Пловдив е „Древен и вечен“, като града става европейска столица на културата за 2019 г. Разположен е в централната част на Горнотракийската низина и през него преминава река Марица – най-пълноводната река в България.', 4, 5, 'Пловдив', 2, 1, 6, 2),
       ('Кърджали е разположен в сърцето на Източнородопския планински масив на двата бряга на река Арда. В това китно кътче на страната са запазени ценни естествени находища на вечнозеления тракийски дъб, бял бор и синя хвойна. Срещат се някои от най-ценните дървесни и растителни видове, вписани в Червената книга на България.', 5, 2, 'Кърджали', 1, 3, 8, 2),
       ('Село Лесковец се намира в планински район. Под селото има язовир на име Бушляк, а над селото е язовир Каваците.', 2, 5, 'Лясковец', 4, 5, 4, 2),
       ('Обиколка на Централен балкан. Райското пръскало е най-високият постоянен водопад в България и на Балканския полуостров – 124,5 m. Намира се в Стара планина, на южния склон под най-високия старопланински връх – Ботев. На територията е на природен резерват „Джендема“. Обявен е за защитен природен обект през 1965 г.',7, 5, 'София', 1, 6, 5,1),
       ('Обиколка на Централен балкан. Райското пръскало е най-високият постоянен водопад в България и на Балканския полуостров – 124,5 m. Намира се в Стара планина, на южния склон под най-високия старопланински връх – Ботев. На територията е на природен резерват „Джендема“. Обявен е за защитен природен обект през 1965 г.',1, 1, 'Пловдив', 1, 6, 9,1),
       ('Обиколка на Централен балкан. Райското пръскало е най-високият постоянен водопад в България и на Балканския полуостров – 124,5 m. Намира се в Стара планина, на южния склон под най-високия старопланински връх – Ботев. На територията е на природен резерват „Джендема“. Обявен е за защитен природен обект през 1965 г.',1, 3, 'Шипка', 1, 5, 10,2),
       ('Обиколка на Централен балкан. Райското пръскало е най-високият постоянен водопад в България и на Балканския полуостров – 124,5 m. Намира се в Стара планина, на южния склон под най-високия старопланински връх – Ботев. На територията е на природен резерват „Джендема“. Обявен е за защитен природен обект през 1965 г.',1, 1, 'София', 1, 6, 11,1);

INSERT INTO  itineraries (created_on, `day`, dinner_place_entity_id, hotel_entity_id, town_id, breakfast_place_id, coffee_place_entity_id, trip_id)
values ('2021-11-11', 1, 1,1,1,8, 1,1),
       ('2021-11-13', 2, 9,2, 2, 9, 2, 1),

       ('2021-11-13', 1, 3,3, 3, 1, 3, 2),
       ('2021-11-14', 2, 3,3, 3, 1, 3, 2),
       ('2021-11-15', 3, 3,3, 3,2, 4, 2),

       ('2021-11-15', 1, 9,4, 5,3, 5, 3),
       ('2021-11-15', 2, 4,4, 5,3, 5, 3),
       ('2021-11-15', 3, 5,4, 5, 6, 5, 3),
       ('2021-11-15', 4, 6,2, 5,4, 7, 3),

       ('2021-11-15', 1, 7,5, 6,5, 8, 4),
       ('2021-11-15', 2, 7,5, 6,6, 9, 4),
       ('2021-11-15', 3, 8,5, 7,7, 9, 4),
       ('2021-11-15', 4, 9,5, 8,6, 10, 4),
       ('2021-11-15', 5, 7,5, 6,7, 11, 4),

       ('2021-11-18', 1, 11,6, 9,10, 12, 5),
       ('2021-11-18', 2, 11,6, 10,11, 13, 5),


       ('2021-11-18', 1, 12,7,11, 12,14, 6),
       ('2021-11-18', 2, 13, 8, 12,13, 15, 6),
       ('2021-11-18', 3, 14,9, 13,14, 16, 6),
       ('2021-11-18', 4, 15,8, 12,13, 15, 6),
       ('2021-11-18', 5, 16,10, 14,15, 17, 6),
       ('2021-11-18', 6, 17,10, 14,15, 18, 6),
       ('2021-11-18', 7, 18,10, 14,15, 17, 6),

       ('2021-11-18', 1, 18,10, 14,15, 17, 7),
       ('2021-11-18', 1, 18,10, 14,15, 17, 8),
       ('2021-11-18', 1, 18,10, 14,15, 17, 9);

INSERT INTO  itineraries_attractions (itineraries_id, attraction_id)
VALUES (1, 1),
       (2, 2),
       (3, 3),
       (4, 4),
       (5, 5),
       (6, 14),
       (7, 6),
       (8, 7),
       (9, 8),
       (10, 9),
       (11, 10),
       (12, 11),
       (13, 12),
       (14, 13),
       (15, 14),
       (16, 15),
       (17,16),
       (18, 17),
       (19, 18),
       (20, 19),
       (21, 20),
       (22, 21),
       (23, 22),
       (24,5),
        (25, 6),
        (26, 10);

INSERT INTO reviews (approved, comment, created_on, trip_id, user_id)
values (true, 'Awesome trip', '2021-11-18', 2, 2),
       (true, 'Awesome trip', '2021-11-18', 5, 1),
       (true, 'It was a great experience!', '2021-11-18', 5, 2),
       (true, 'Awesome trip', '2021-11-18', 1, 1);

INSERT INTO user_favourite(user_id, favourite_id)
values (2,1),
       (2,3),
       (2,2);

